RusBabakyan/VL53L0X_STM32_HAL_MULTI/VL53L_test_2_HAL/VL53L0X/VL53L0X.c
  // VL53L0X_StaticInit() begin

  uint8_t spad_count;
  bool spad_type_is_aperture;
  if (!getSpadInfo(dev, &spad_count, &spad_type_is_aperture)) { return false; }

  // The SPAD map (RefGoodSpadMap) is read by VL53L0X_get_info_from_device() in
  // the API, but the same data seems to be more easily readable from
  // GLOBAL_CONFIG_SPAD_ENABLES_REF_0 through _6, so read it from there
  uint8_t ref_spad_map[6];
  readMulti(dev, GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);

  // -- VL53L0X_set_reference_spads() begin (assume NVM values are valid)

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,DYNAMIC_SPAD_REF_EN_START_OFFSET, 0x00);
  writeReg(dev,DYNAMIC_SPAD_NUM_REQUESTED_REF_SPAD, 0x2C);
  writeReg(dev,0xFF, 0x00);
  writeReg(dev,GLOBAL_CONFIG_REF_EN_START_SELECT, 0xB4);

  uint8_t first_spad_to_enable = spad_type_is_aperture ? 12 : 0; // 12 is the first aperture spad
  uint8_t spads_enabled = 0;

  for (uint8_t i = 0; i < 48; i++)
  {
    if (i < first_spad_to_enable || spads_enabled == spad_count)
    {
      // This bit is lower than the first one that should be enabled, or
      // (reference_spad_count) bits have already been enabled, so zero this bit
      ref_spad_map[i / 8] &= ~(1 << (i % 8));
    }
    else if ((ref_spad_map[i / 8] >> (i % 8)) & 0x1)
    {
      spads_enabled++;
    }
  }

  writeMulti(dev, GLOBAL_CONFIG_SPAD_ENABLES_REF_0, ref_spad_map, 6);

  // -- VL53L0X_set_reference_spads() end

  // -- VL53L0X_load_tuning_settings() begin
  // DefaultTuningSettings from vl53l0x_tuning.h

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x00);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x09, 0x00);
  writeReg(dev,0x10, 0x00);
  writeReg(dev,0x11, 0x00);

  writeReg(dev,0x24, 0x01);
  writeReg(dev,0x25, 0xFF);
  writeReg(dev,0x75, 0x00);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x4E, 0x2C);
  writeReg(dev,0x48, 0x00);
  writeReg(dev,0x30, 0x20);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x30, 0x09);
  writeReg(dev,0x54, 0x00);
  writeReg(dev,0x31, 0x04);
  writeReg(dev,0x32, 0x03);
  writeReg(dev,0x40, 0x83);
  writeReg(dev,0x46, 0x25);
  writeReg(dev,0x60, 0x00);
  writeReg(dev,0x27, 0x00);
  writeReg(dev,0x50, 0x06);
  writeReg(dev,0x51, 0x00);
  writeReg(dev,0x52, 0x96);
  writeReg(dev,0x56, 0x08);
  writeReg(dev,0x57, 0x30);
  writeReg(dev,0x61, 0x00);
  writeReg(dev,0x62, 0x00);
  writeReg(dev,0x64, 0x00);
  writeReg(dev,0x65, 0x00);
  writeReg(dev,0x66, 0xA0);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x22, 0x32);
  writeReg(dev,0x47, 0x14);
  writeReg(dev,0x49, 0xFF);
  writeReg(dev,0x4A, 0x00);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x7A, 0x0A);
  writeReg(dev,0x7B, 0x00);
  writeReg(dev,0x78, 0x21);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x23, 0x34);
  writeReg(dev,0x42, 0x00);
  writeReg(dev,0x44, 0xFF);
  writeReg(dev,0x45, 0x26);
  writeReg(dev,0x46, 0x05);
  writeReg(dev,0x40, 0x40);
  writeReg(dev,0x0E, 0x06);
  writeReg(dev,0x20, 0x1A);
  writeReg(dev,0x43, 0x40);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x34, 0x03);
  writeReg(dev,0x35, 0x44);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x31, 0x04);
  writeReg(dev,0x4B, 0x09);
  writeReg(dev,0x4C, 0x05);
  writeReg(dev,0x4D, 0x04);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x44, 0x00);
  writeReg(dev,0x45, 0x20);
  writeReg(dev,0x47, 0x08);
  writeReg(dev,0x48, 0x28);
  writeReg(dev,0x67, 0x00);
  writeReg(dev,0x70, 0x04);
  writeReg(dev,0x71, 0x01);
  writeReg(dev,0x72, 0xFE);
  writeReg(dev,0x76, 0x00);
  writeReg(dev,0x77, 0x00);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x0D, 0x01);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x80, 0x01);
  writeReg(dev,0x01, 0xF8);

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x8E, 0x01);
  writeReg(dev,0x00, 0x01);
  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x80, 0x00);

  // -- VL53L0X_load_tuning_settings() end

  // "Set interrupt config to new sample ready"
  // -- VL53L0X_SetGpioConfig() begin

  writeReg(dev,SYSTEM_INTERRUPT_CONFIG_GPIO, 0x04);
  writeReg(dev,GPIO_HV_MUX_ACTIVE_HIGH, readReg(dev, GPIO_HV_MUX_ACTIVE_HIGH) & ~0x10); // active low
  writeReg(dev,SYSTEM_INTERRUPT_CLEAR, 0x01);

  // -- VL53L0X_SetGpioConfig() end

  dev->g_measTimBudUs = getMeasurementTimingBudget(dev);

  // "Disable MSRC and TCC by default"
  // MSRC = Minimum Signal Rate Check
  // TCC = Target CentreCheck
  // -- VL53L0X_SetSequenceStepEnable() begin

  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, 0xE8);

  // -- VL53L0X_SetSequenceStepEnable() end

  // "Recalculate timing budget"
  setMeasurementTimingBudget(dev, dev->g_measTimBudUs);

  // VL53L0X_StaticInit() end

  // VL53L0X_PerformRefCalibration() begin (VL53L0X_perform_ref_calibration())

  // -- VL53L0X_perform_vhv_calibration() begin

  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, 0x01);
  if (!performSingleRefCalibration(dev, 0x40)) { return false; }

  // -- VL53L0X_perform_vhv_calibration() end

  // -- VL53L0X_perform_phase_calibration() begin

  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, 0x02);
  if (!performSingleRefCalibration(dev, 0x00)) { return false; }

  // -- VL53L0X_perform_phase_calibration() end

  // "restore the previous Sequence Config"
  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, 0xE8);

  // VL53L0X_PerformRefCalibration() end

  return true;
}

// Set the return signal rate limit check value in units of MCPS (mega counts
// per second). "This represents the amplitude of the signal reflected from the
// target and detected by the device"; setting this limit presumably determines
// the minimum measurement necessary for the sensor to report a valid reading.
// Setting a lower limit increases the potential range of the sensor but also
// seems to increase the likelihood of getting an inaccurate reading because of
// unwanted reflections from objects other than the intended target.
// Defaults to 0.25 MCPS as initialized by the ST API and this library.
bool setSignalRateLimit(VL53L0X *dev, float limit_Mcps)
{
  if (limit_Mcps < 0 || limit_Mcps > 511.99) { return false; }

  // Q9.7 fixed point format (9 integer bits, 7 fractional bits)
  writeReg16Bit(dev, FINAL_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT, limit_Mcps * (1 << 7));
  return true;
}

// Get the return signal rate limit check value in MCPS
float getSignalRateLimit(VL53L0X *dev)
{
  return (float)readReg16Bit(dev, FINAL_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT) / (1 << 7);
}

// Set the measurement timing budget in microseconds, which is the time allowed
// for one measurement; the ST API and this library take care of splitting the
// timing budget among the sub-steps in the ranging sequence. A longer timing
// budget allows for more accurate measurements. Increasing the budget by a
// factor of N decreases the range measurement standard deviation by a factor of
// sqrt(N). Defaults to about 33 milliseconds; the minimum is 20 ms.
// based on VL53L0X_set_measurement_timing_budget_micro_seconds()
bool setMeasurementTimingBudget(VL53L0X *dev, uint32_t budget_us)
{
  SequenceStepEnables enables;
  SequenceStepTimeouts timeouts;

  uint16_t const StartOverhead      = 1320; // note that this is different than the value in get_
  uint16_t const EndOverhead        = 960;
  uint16_t const MsrcOverhead       = 660;
  uint16_t const TccOverhead        = 590;
  uint16_t const DssOverhead        = 690;
  uint16_t const PreRangeOverhead   = 660;
  uint16_t const FinalRangeOverhead = 550;

  uint32_t const MinTimingBudget = 20000;

  if (budget_us < MinTimingBudget) { return false; }

  uint32_t used_budget_us = StartOverhead + EndOverhead;

  getSequenceStepEnables(dev, &enables);
  getSequenceStepTimeouts(dev, &enables, &timeouts);

  if (enables.tcc)
  {
    used_budget_us += (timeouts.msrc_dss_tcc_us + TccOverhead);
  }

  if (enables.dss)
  {
    used_budget_us += 2 * (timeouts.msrc_dss_tcc_us + DssOverhead);
  }
  else if (enables.msrc)
  {
    used_budget_us += (timeouts.msrc_dss_tcc_us + MsrcOverhead);
  }

