RusBabakyan/VL53L0X_STM32_HAL_MULTI/VL53L_test_2_HAL/VL53L0X/VL53L0X.c
      case 12:
        writeReg(dev,FINAL_RANGE_CONFIG_VALID_PHASE_HIGH, 0x38);
        writeReg(dev,FINAL_RANGE_CONFIG_VALID_PHASE_LOW,  0x08);
        writeReg(dev,GLOBAL_CONFIG_VCSEL_WIDTH, 0x03);
        writeReg(dev,ALGO_PHASECAL_CONFIG_TIMEOUT, 0x08);
        writeReg(dev,0xFF, 0x01);
        writeReg(dev,ALGO_PHASECAL_LIM, 0x20);
        writeReg(dev,0xFF, 0x00);
        break;

      case 14:
        writeReg(dev,FINAL_RANGE_CONFIG_VALID_PHASE_HIGH, 0x48);
        writeReg(dev,FINAL_RANGE_CONFIG_VALID_PHASE_LOW,  0x08);
        writeReg(dev,GLOBAL_CONFIG_VCSEL_WIDTH, 0x03);
        writeReg(dev,ALGO_PHASECAL_CONFIG_TIMEOUT, 0x07);
        writeReg(dev,0xFF, 0x01);
        writeReg(dev,ALGO_PHASECAL_LIM, 0x20);
        writeReg(dev,0xFF, 0x00);
        break;

      default:
        // invalid period
        return false;
    }

    // apply new VCSEL period
    writeReg(dev,FINAL_RANGE_CONFIG_VCSEL_PERIOD, vcsel_period_reg);

    // update timeouts

    // set_sequence_step_timeout() begin
    // (SequenceStepId == VL53L0X_SEQUENCESTEP_FINAL_RANGE)

    // "For the final range timeout, the pre-range timeout
    //  must be added. To do this both final and pre-range
    //  timeouts must be expressed in macro periods MClks
    //  because they have different vcsel periods."

    uint16_t new_final_range_timeout_mclks =
      timeoutMicrosecondsToMclks(timeouts.final_range_us, period_pclks);

    if (enables.pre_range)
    {
      new_final_range_timeout_mclks += timeouts.pre_range_mclks;
    }

    writeReg16Bit(dev, FINAL_RANGE_CONFIG_TIMEOUT_MACROP_HI,
      encodeTimeout(new_final_range_timeout_mclks));

    // set_sequence_step_timeout end
  }
  else
  {
    // invalid type
    return false;
  }

  // "Finally, the timing budget must be re-applied"

  setMeasurementTimingBudget(dev, dev->g_measTimBudUs);

  // "Perform the phase calibration. This is needed after changing on vcsel period."
  // VL53L0X_perform_phase_calibration() begin

  uint8_t sequence_config = readReg(dev, SYSTEM_SEQUENCE_CONFIG);
  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, 0x02);
  performSingleRefCalibration(dev, 0x0);
  writeReg(dev,SYSTEM_SEQUENCE_CONFIG, sequence_config);

  // VL53L0X_perform_phase_calibration() end

  return true;
}

// Get the VCSEL pulse period in PCLKs for the given period type.
// based on VL53L0X_get_vcsel_pulse_period()
uint8_t getVcselPulsePeriod(VL53L0X *dev, vcselPeriodType type)
{
  if (type == VcselPeriodPreRange)
  {
    return decodeVcselPeriod(readReg(dev, PRE_RANGE_CONFIG_VCSEL_PERIOD));
  }
  else if (type == VcselPeriodFinalRange)
  {
    return decodeVcselPeriod(readReg(dev, FINAL_RANGE_CONFIG_VCSEL_PERIOD));
  }
  else { return 255; }
}

// Start continuous ranging measurements. If period_ms (optional) is 0 or not
// given, continuous back-to-back mode is used (the sensor takes measurements as
// often as possible); otherwise, continuous timed mode is used, with the given
// inter-measurement period in milliseconds determining how often the sensor
// takes a measurement.
// based on VL53L0X_StartMeasurement()
void startContinuous(VL53L0X *dev, uint32_t period_ms)
{
  writeReg(dev,0x80, 0x01);
  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x00);
  writeReg(dev,0x91, dev->g_stopVariable);
  writeReg(dev,0x00, 0x01);
  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x80, 0x00);

  if (period_ms != 0)
  {
    // continuous timed mode

    // VL53L0X_SetInterMeasurementPeriodMilliSeconds() begin

    uint16_t osc_calibrate_val = readReg16Bit(dev, OSC_CALIBRATE_VAL);

    if (osc_calibrate_val != 0)
    {
      period_ms *= osc_calibrate_val;
    }

    writeReg32Bit(dev, SYSTEM_INTERMEASUREMENT_PERIOD, period_ms);

    // VL53L0X_SetInterMeasurementPeriodMilliSeconds() end

    writeReg(dev,SYSRANGE_START, 0x04); // VL53L0X_REG_SYSRANGE_MODE_TIMED
  }
  else
  {
    // continuous back-to-back mode
    writeReg(dev,SYSRANGE_START, 0x02); // VL53L0X_REG_SYSRANGE_MODE_BACKTOBACK
  }
}

// Stop continuous measurements
// based on VL53L0X_StopMeasurement()
void stopContinuous(VL53L0X *dev)
{
  writeReg(dev,SYSRANGE_START, 0x01); // VL53L0X_REG_SYSRANGE_MODE_SINGLESHOT

  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x00);
  writeReg(dev,0x91, 0x00);
  writeReg(dev,0x00, 0x01);
  writeReg(dev,0xFF, 0x00);
}

// Returns a range reading in millimeters when continuous mode is active
// (readRangeSingleMillimeters() also calls this function after starting a
// single-shot range measurement)
// extraStats provides additional info for this measurment. Set to 0 if not needed.
uint16_t readRangeContinuousMillimeters(VL53L0X *dev,  statInfo_t_VL53L0X *extraStats ) {
  uint8_t tempBuffer[12];
  uint16_t temp;
  startTimeout();
  while ((readReg(dev, RESULT_INTERRUPT_STATUS) & 0x07) == 0) {
    if (checkTimeoutExpired())
    {
      dev->g_isTimeout = true;
      return 65535;
    }
  }
  if( extraStats == 0 ){
    // assumptions: Linearity Corrective Gain is 1000 (default);
    // fractional ranging is not enabled
    temp = readReg16Bit(dev, RESULT_RANGE_STATUS + 10);
  } else {
    // Register map starting at 0x14
    //     0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F
    //    5A 06 BC 04 00 85 00 38 00 19 06 B6 00 00 00 00
    //   0: Ranging status, uint8_t
    //   1: ???
    // 3,2: Effective SPAD return count, uint16_t, fixpoint8.8
    //   4: 0 ?
    //   5: ???
    // 6,7: signal count rate [mcps], uint16_t, fixpoint9.7
    // 9,8: AmbientRateRtnMegaCps  [mcps], uint16_t, fixpoimt9.7
    // A,B: uncorrected distance [mm], uint16_t
    readMulti(dev, 0x14, tempBuffer, 12);
    extraStats->rangeStatus =  tempBuffer[0x00]>>3;
    extraStats->spadCnt     = (tempBuffer[0x02]<<8) | tempBuffer[0x03];
    extraStats->signalCnt   = (tempBuffer[0x06]<<8) | tempBuffer[0x07];
    extraStats->ambientCnt  = (tempBuffer[0x08]<<8) | tempBuffer[0x09];    
    temp                    = (tempBuffer[0x0A]<<8) | tempBuffer[0x0B];
    extraStats->rawDistance = temp;
  }
  writeReg(dev,SYSTEM_INTERRUPT_CLEAR, 0x01);
  return temp;
}

