RusBabakyan/VL53L0X_STM32_HAL_MULTI/VL53L_test_2_HAL/VL53L0X/VL53L0X.c
uint8_t checkRangeContinuousMillimeters(VL53L0X *dev,  statInfo_t_VL53L0X *extraStats, uint16_t *_distance){
	  uint8_t tempBuffer[12];
	  uint16_t temp;
	  if ((readReg(dev, RESULT_INTERRUPT_STATUS) & 0x07) == 0){
		  return 0;
	  }
	  if( extraStats == 0 ){
	    // assumptions: Linearity Corrective Gain is 1000 (default);
	    // fractional ranging is not enabled
	    temp = readReg16Bit(dev, RESULT_RANGE_STATUS + 10);
	  } else {
	    // Register map starting at 0x14
	    //     0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F
	    //    5A 06 BC 04 00 85 00 38 00 19 06 B6 00 00 00 00
	    //   0: Ranging status, uint8_t
	    //   1: ???
	    // 3,2: Effective SPAD return count, uint16_t, fixpoint8.8
	    //   4: 0 ?
	    //   5: ???
	    // 6,7: signal count rate [mcps], uint16_t, fixpoint9.7
	    // 9,8: AmbientRateRtnMegaCps  [mcps], uint16_t, fixpoimt9.7
	    // A,B: uncorrected distance [mm], uint16_t
	    readMulti(dev, 0x14, tempBuffer, 12);
	    extraStats->rangeStatus =  tempBuffer[0x00]>>3;
	    extraStats->spadCnt     = (tempBuffer[0x02]<<8) | tempBuffer[0x03];
	    extraStats->signalCnt   = (tempBuffer[0x06]<<8) | tempBuffer[0x07];
	    extraStats->ambientCnt  = (tempBuffer[0x08]<<8) | tempBuffer[0x09];
	    temp                    = (tempBuffer[0x0A]<<8) | tempBuffer[0x0B];
	    extraStats->rawDistance = temp;
	  }
	  writeReg(dev,SYSTEM_INTERRUPT_CLEAR, 0x01);
	  *_distance = temp;
	  return 1;
}

// Performs a single-shot range measurement and returns the reading in
// millimeters
// based on VL53L0X_PerformSingleRangingMeasurement()
// extraStats provides additional info for this measurment. Set to 0 if not needed.
uint16_t readRangeSingleMillimeters(VL53L0X *dev,  statInfo_t_VL53L0X *extraStats ) {
  writeReg(dev,0x80, 0x01);
  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x00);
  writeReg(dev,0x91, dev->g_stopVariable);
  writeReg(dev,0x00, 0x01);
  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x80, 0x00);
  writeReg(dev,SYSRANGE_START, 0x01);
  // "Wait until start bit has been cleared"
  startTimeout();
  while (readReg(dev, SYSRANGE_START) & 0x01){
    if (checkTimeoutExpired()){
      dev->g_isTimeout = true;
      return 65535;
    }
  }
  return readRangeContinuousMillimeters(dev,  extraStats );
}

// Did a timeout occur in one of the read functions since the last call to
// timeoutOccurred()?
bool timeoutOccurred(VL53L0X *dev)
{
  bool tmp = dev->g_isTimeout;
  dev->g_isTimeout = false;
  return tmp;
}

void setTimeout(VL53L0X *dev, uint16_t timeout){
  dev->g_ioTimeout = timeout;
}

uint16_t getTimeout(VL53L0X *dev){
  return dev->g_ioTimeout;
}

// Private Methods /////////////////////////////////////////////////////////////

// Get reference SPAD (single photon avalanche diode) count and type
// based on VL53L0X_get_info_from_device(),
// but only gets reference SPAD count and type
bool getSpadInfo(VL53L0X *dev, uint8_t * count, bool * type_is_aperture)
{
  uint8_t tmp;

  writeReg(dev,0x80, 0x01);
  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x00);

  writeReg(dev,0xFF, 0x06);
  writeReg(dev,0x83, readReg(dev, 0x83) | 0x04);
  writeReg(dev,0xFF, 0x07);
  writeReg(dev,0x81, 0x01);

  writeReg(dev,0x80, 0x01);

  writeReg(dev,0x94, 0x6b);
  writeReg(dev,0x83, 0x00);
  startTimeout();
  while (readReg(dev, 0x83) == 0x00)
  {
    if (checkTimeoutExpired()) { return false; }
  }
  writeReg(dev,0x83, 0x01);
  tmp = readReg(dev, 0x92);

  *count = tmp & 0x7f;
  *type_is_aperture = (tmp >> 7) & 0x01;

  writeReg(dev,0x81, 0x00);
  writeReg(dev,0xFF, 0x06);
  writeReg(dev,0x83, readReg(dev, 0x83)  & ~0x04);
  writeReg(dev,0xFF, 0x01);
  writeReg(dev,0x00, 0x01);

  writeReg(dev,0xFF, 0x00);
  writeReg(dev,0x80, 0x00);

  return true;
}

// Get sequence step enables
// based on VL53L0X_GetSequenceStepEnables()
void getSequenceStepEnables(VL53L0X *dev, SequenceStepEnables * enables)
{
  uint8_t sequence_config = readReg(dev, SYSTEM_SEQUENCE_CONFIG);

  enables->tcc          = (sequence_config >> 4) & 0x1;
  enables->dss          = (sequence_config >> 3) & 0x1;
  enables->msrc         = (sequence_config >> 2) & 0x1;
  enables->pre_range    = (sequence_config >> 6) & 0x1;
  enables->final_range  = (sequence_config >> 7) & 0x1;
}

// Get sequence step timeouts
// based on get_sequence_step_timeout(),
// but gets all timeouts instead of just the requested one, and also stores
// intermediate values
void getSequenceStepTimeouts(VL53L0X *dev, SequenceStepEnables const * enables, SequenceStepTimeouts * timeouts)
{
  timeouts->pre_range_vcsel_period_pclks = getVcselPulsePeriod(dev, VcselPeriodPreRange);

  timeouts->msrc_dss_tcc_mclks = readReg(dev, MSRC_CONFIG_TIMEOUT_MACROP) + 1;
  timeouts->msrc_dss_tcc_us =
    timeoutMclksToMicroseconds(timeouts->msrc_dss_tcc_mclks,
                               timeouts->pre_range_vcsel_period_pclks);

  timeouts->pre_range_mclks =
    decodeTimeout(readReg16Bit(dev, PRE_RANGE_CONFIG_TIMEOUT_MACROP_HI));
  timeouts->pre_range_us =
    timeoutMclksToMicroseconds(timeouts->pre_range_mclks,
                               timeouts->pre_range_vcsel_period_pclks);

  timeouts->final_range_vcsel_period_pclks = getVcselPulsePeriod(dev, VcselPeriodFinalRange);

  timeouts->final_range_mclks =
    decodeTimeout(readReg16Bit(dev, FINAL_RANGE_CONFIG_TIMEOUT_MACROP_HI));

  if (enables->pre_range)
  {
    timeouts->final_range_mclks -= timeouts->pre_range_mclks;
  }

  timeouts->final_range_us =
    timeoutMclksToMicroseconds(timeouts->final_range_mclks,
                               timeouts->final_range_vcsel_period_pclks);
}

// Decode sequence step timeout in MCLKs from register value
// based on VL53L0X_decode_timeout()
// Note: the original function returned a uint32_t, but the return value is
// always stored in a uint16_t.
uint16_t decodeTimeout(uint16_t reg_val)
{
  // format: "(LSByte * 2^MSByte) + 1"
  return (uint16_t)((reg_val & 0x00FF) <<
         (uint16_t)((reg_val & 0xFF00) >> 8)) + 1;
}

// Encode sequence step timeout register value from timeout in MCLKs
// based on VL53L0X_encode_timeout()
// Note: the original function took a uint16_t, but the argument passed to it
// is always a uint16_t.
uint16_t encodeTimeout(uint16_t timeout_mclks)
{
  // format: "(LSByte * 2^MSByte) + 1"

